[{"title":"All the 2025 F1 driver numbers confirmed in full","author":"F1 Website","body":"The reasons behind drivers picking their numbers can be absolutely anything and everything. For example, Charles Leclerc runs with the number 16 because he originally wanted number seven or 10 but both were taken.\n\n\"I finally ended up with number 16, because one plus six equals seven and I am born the 16th of October,” the Monegasque said of his choice.\n\nFor two-time world champion and current Aston Martin racer Fernando Alonso, his number 14 holds special memories. “When I was 14 years old, the 14th of July, and with the go-kart number 14, I was world champion. From that moment I had no doubt that 14 is my number,\" he said.","comments":[2],"date":1738212684976,"id":0},{"title":"How Williams Heritage keep the team’s ‘Crown Jewels’ in tip-top condition","author":"F1 Website","body":"Williams boast one of the richest histories in the F1 paddock, sitting third in the all-time list for Grands Prix entered and joint second in terms of constructors’ championships won. Making their full-scale arrival back in 1978, the outfit have produced a selection of iconic cars over the years, plenty of which – thanks to Williams Heritage – are still being shown off as museum pieces and driven at tracks today. F1.com paid a visit to the division to find out what’s involved...\n\nWilliams Heritage was created in 2014 to, in their own words, “manage, preserve and celebrate Williams’s iconic legacy”, with nine constructors’ championships, seven drivers’ championships and 114 race wins being achieved across an almost 50-year spell in the top echelon.\n\nKennard took on the main role a year ago, having previously built and managed his own historic F1 events company, which involved acquiring and restoring historic cars, and been personally connected to Williams in the past when he spent 2008 as one of their test drivers.","comments":[0,1],"date":1738212757852,"id":1},{"title":"New team boss Cowell explains how he plans to change Aston Martin’s on-track fortunes","author":"F1 Website","body":"Andy Cowell has taken a moment to reflect on his first few months at Aston Martin, highlighting the importance of simply “talking to people and listening” as he sets about helping the squad climb the F1 pecking order.","comments":[],"date":1738213161481,"id":2}]